#include <iostream>
using namespace std;
#include "Source.h"

void fun(int number)
{
	int d2;
	int st, dt, t, h, d, u, m;
	u = (number % 10);
	d = (number % 100) / 10;
	h = (number % 1000) / 100;
	t = (number % 10000) / 1000;
	dt = (number % 100000) / 10000;
	st = (number % 1000000) / 100000;
	m = number / 1000000;

	//debug

	cout << endl << endl;
	cout << "Миллионы       " << m << endl;
	cout << "Сотни тысяч    " << st << endl;
	cout << "Десятки тысяч  " << dt << endl;
	cout << "Тысячи         " << t << endl;
	cout << "Сотни          " << h << endl;
	cout << "Десятки        " << d << endl;
	cout << "Единицы        " << u << endl;
	cout << endl << endl;

	// enddebug

	//единицы
	const char* first[] = { "", "один ", "два ",
	"три ", "четыре ","пять ",
	"шесть ", "семь ", "восемь ", "девять " };

	//десять - девятнадцать
	const char* second[] = { "десять ", "одиннадцать" , "двенадцать ",
	"тринадцать ", "четырнадцать ",
	"пятнадцать ", "шестнадцать ",
	"семнадцать ", "восемнадцать ", "девятнадцать " };

	// десятки
	const char* third[] = { "", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ",
	"шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто " };

	// сотни
	const char* fourth[] = { "", "сто ", "двести ", "триста ", "четыреста ",
	"пятсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот " };

	// тысячи
	const char* fifth[] = { "", "одна тысяча ", "две тысячи ","три тысячи ", "четыре тысячи ",
		"пять тысячь ", "шесть тысяч ", "семь тысячь ", "восемь тысячь ", "девять тысячь " };


	const char* sixth[] = { "", "десять тысячь ", "двадцать тысячь ", "тридцать тысячь ",
		"сорок тысячь ", "пятдесят тысячь ", "шестдесят тысячь ", "семдесят тысячь ",
		"восемдесят тысячь ", "девяносто тысячь " };


	if (m > 0)
	{
		cout << first[m];
		if (m == 1)
		{
			cout << "миллион ";
		}
		else cout << "миллиона ";
	}

	if (st > 0)
	{
		cout << fourth[st];
		if (dt == 0) cout << "тысячь ";
	}
	if (dt > 0)
	{
		if (dt * 10 + t > 10 && dt * 10 + t < 20)
		{
			cout << second[t] << "тысячь ";
		}
		else
		{
			cout << third[dt];
			if (t < 1)
			{
				cout << "тысячь ";
			}
			if (t > 0)
			{
				cout << fifth[t];
			}
		}
	}

	cout << fourth[h];

	if (d * 10 + u > 10 & d * 10 + u < 20)
	{
		cout << second[u];
	}
	else
	{
		cout << third[d];
		cout << first[u];
	}

	cout << endl;
	cout << endl;
}